lvx/base/DataProcessors/бит_ЗакрытиеДокументовПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ЗакрытиеДокументовПланирования</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимСообщений</Name>
					<Comment>Режим сообщений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Comment>Причина закрытия</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныЗакрытияДокументовПланированияПлатежа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикНастроек</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРегламентнаяОперация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьДокументов</Name>
					<Comment>Перечень документов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Закрыть</Name>
							<Comment>Закрыть</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Comment>Организация</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗаявки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПланирования</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_пз_ЗаявкаНаЗатраты</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПланируемоеПоступлениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_пз_СводнаяЗаявкаНаЗатраты</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаРасходованиеСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_пз_ОтражениеФактаЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Позиция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПозицияПоступления</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПлатежнаяПозиция</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_пз_ЗаявкаНаЗатраты</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПланируемоеПоступлениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_пз_СводнаяЗаявкаНаЗатраты</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаРасходованиеСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_пз_ОтражениеФактаЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>Контрагент</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Comment>ЦФО</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Comment>Сумма документа</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОстаток</Name>
							<Comment>Сумма остаток</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаДокумента</Name>
							<Comment>Валюта документа</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаЗакрытия</Name>
							<Comment>Причина закрытия</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПричиныЗакрытияДокументовПланированияПлатежа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусПозиции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

lvx/base/Documents/бит_кзн_ЗакрытиеДокументовПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_кзн_ЗакрытиеДокументовПланирования</Name>
			<BasedOn>
				<xr:Item>Document.бит_кзн_ЗаявкаНаРасходованиеСредств</xr:Item>
				<xr:Item>Document.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</xr:Item>
				<xr:Item>Document.бит_кзн_ПланируемоеПоступлениеДенежныхСредств</xr:Item>
				<xr:Item>Document.бит_кзн_ПлатежнаяПозиция</xr:Item>
				<xr:Item>Document.бит_кзн_ПозицияПоступления</xr:Item>
				<xr:Item>Document.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</xr:Item>
				<xr:Item>Document.бит_пз_ЗаявкаНаЗатраты</xr:Item>
				<xr:Item>Document.бит_пз_СводнаяЗаявкаНаЗатраты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_кзн_ПланируемоеПоступлениеДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.бит_КонтрольныеЗначенияБюджетов</xr:Item>
				<xr:Item>AccumulationRegister.бит_кзн_ПланируемыйРасходДенежныхСредствАналитика</xr:Item>
				<xr:Item>AccumulationRegister.бит_кзн_ПланируемоеПоступлениеДенежныхСредствАналитика</xr:Item>
				<xr:Item>AccumulationRegister.бит_кзн_ПланируемыйРасходДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.бит_пз_ПланируемыеЗатраты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка - служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыПланирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументПланирования</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПозицияПоступления</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПлатежнаяПозиция</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_пз_ЗаявкаНаЗатраты</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПланируемоеПоступлениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_пз_СводнаяЗаявкаНаЗатраты</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаРасходованиеСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_пз_ОтражениеФактаЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаЗакрытия</Name>
							<Comment>Причина закрытия</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПричиныЗакрытияДокументовПланированияПлатежа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/DataProcessors/бит_ЗакрытиеДокументовПланирования/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура настраивае обработку для выполнения регламентной операции
// и закрывает документы планирования.
// 
// Параметры:
//  НастройкаПодбораДокументов - Структура см. НовыеСохраняемыеНастройки().
// 
Процедура ВыполнитьРегламентнуюОперацию(НастройкаПодбораДокументов) Экспорт
    
	ТипыДокументов = Новый СписокЗначений;
	
	ЗаполнитьТипыДокументов(ТипыДокументов);

	Обработка = Обработки.бит_ЗакрытиеДокументовПланирования.Создать();
	АдресСКД  = ПрименитьНастройки(НастройкаПодбораДокументов, ТипыДокументов, Обработка);

	СКД 					   = ПолучитьИзВременногоХранилища(АдресСКД);
	НастройкиКомпоновкиДанных  = Обработка.КомпоновщикНастроек.ПолучитьНастройки();

	КонецПериодаОстатки = Новый Граница(КонецДня(Обработка.Период.ДатаОкончания), ВидГраницы.Включая);
	
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновкиДанных, "НачалоПериода", 	  Обработка.Период.ДатаНачала);
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновкиДанных, "КонецПериода", 		  Обработка.Период.ДатаОкончания);
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновкиДанных, "КонецПериодаОстатки", КонецПериодаОстатки);
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновкиДанных, "ПричинаЗакрытия", 	  Обработка.ПричинаЗакрытия);

	// Заполним перечен документов.
	ТаблицаДокументов = ЗаполнитьПереченьДокументов(СКД, НастройкиКомпоновкиДанных);
	
	// Установим все флаги
	Если ТаблицаДокументов.Колонки.Найти("Закрыть") = Неопределено Тогда
		ТаблицаДокументов.Колонки.Добавить("Закрыть", Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	ТаблицаДокументов.ЗаполнитьЗначения(Истина, "Закрыть");
	
	Обработка.ПереченьДокументов.Загрузить(ТаблицаДокументов);
	
	ПараметрыЗакрытьДокументы = НовыеПараметрыЗакрытьДокументы();
	
	ЗаполнитьЗначенияСвойств(ПараметрыЗакрытьДокументы, Обработка);
	
	ПараметрыЗакрытьДокументы.ЭтоРегламентнаяОперация = Истина;
	ПараметрыЗакрытьДокументы.ПричинаЗакрытия		  = Справочники.бит_ПричиныЗакрытияДокументовПланированияПлатежа.Регламент;
	
	ЗакрытьДокументы(Обработка.ПереченьДокументов, ПараметрыЗакрытьДокументы);

КонецПроцедуры

Функция НовыеПараметрыЗакрытьДокументы() Экспорт
	
	ПараметрыИсполнения = Новый Структура;
	ПараметрыИсполнения.Вставить("РежимСообщений", "");
	ПараметрыИсполнения.Вставить("Период", Новый СтандартныйПериод);
	ПараметрыИсполнения.Вставить("РежимЗаписи", "");
	ПараметрыИсполнения.Вставить("АдресРезультата", "");
	ПараметрыИсполнения.Вставить("ЭтоРегламентнаяОперация", Ложь);
	ПараметрыИсполнения.Вставить("ПричинаЗакрытия", Неопределено);
	
	Возврат ПараметрыИсполнения;

КонецФункции

// Процедура выполняет закрытие документов планирования.
// 
// Параметры:
//  ТаблицаДокументов - ТаблицаЗначений - перечень документов.
// 	Параметры - Структура, ОбработкаОбъект - параметры.
// 
Процедура ЗакрытьДокументы(ТаблицаДокументов, Параметры) Экспорт
	
	СписокДокументов = Новый Массив; 
	
    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("ПереченьДокументов", ТаблицаДокументов);
	Запрос.УстановитьПараметр("ПричинаЗакрытия", 	Параметры.ПричинаЗакрытия);
	
	Запрос.Текст	 = ТекстЗапросаПереченьДокументов();
    РезультатЗапроса = Запрос.Выполнить();
    
    Если РезультатЗапроса.Пустой() Тогда
        Возврат;
	КонецЕсли;
	
	Комментарий = "";
	Если Параметры.ЭтоРегламентнаяОперация Тогда
		Комментарий = НСтр("ru = '# Регламентное закрытие документов'; en = '# Closing documents'");
	КонецЕсли;

    ВыводитьОшибки         = Параметры.РежимСообщений = "Все" ИЛИ Параметры.РежимСообщений = "Ошибки";
	ВыводитьИнформацию     = Параметры.РежимСообщений = "Все";
    ДатаДокументовЗакрытия = КонецДня(Параметры.Период.ДатаОкончания);
    ТекущийПользователь    = Пользователи.ТекущийПользователь();
    ВыборкаПоОрганизации   = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    
    Пока ВыборкаПоОрганизации.Следующий() Цикл

        ДокументЗакрытия = Документы.бит_кзн_ЗакрытиеДокументовПланирования.СоздатьДокумент();// ++ NB  
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("Дата",			ДатаДокументовЗакрытия);
		ДанныеЗаполнения.Вставить("Организация",	ВыборкаПоОрганизации.Организация);
		ДанныеЗаполнения.Вставить("Ответственный",	ТекущийПользователь);
		ДанныеЗаполнения.Вставить("Комментарий", 	Комментарий);

		ДокументЗакрытия.Заполнить(ДанныеЗаполнения);
		
		ВыборкаПоДокументам = ВыборкаПоОрганизации.Выбрать();
        Пока ВыборкаПоДокументам.Следующий() Цикл
            НоваяСтрока = ДокументЗакрытия.ДокументыПланирования.Добавить(); 
            ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоДокументам);
        КонецЦикла;
        
        Попытка
            ДокументЗакрытия.Записать(РежимЗаписиДокумента[Параметры.РежимЗаписи]);
            Если ВыводитьИнформацию Тогда
                ТекстСообщения = НСтр("ru='Записан документ ""%1"".';en='Written document ""%1"".'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ДокументЗакрытия.Ссылка);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДокументЗакрытия.Ссылка);
            КонецЕсли; 
			СписокДокументов.Добавить(ДокументЗакрытия.Ссылка);
        Исключение
            Если ВыводитьОшибки Тогда
				ТекстСообщения = НСтр("ru = 'Не удалось записать документ по причине: %1';
									  |en = 'Could not write the document because of: %1'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
                ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Истина);
            КонецЕсли; 
        КонецПопытки;
    КонецЦикла;
	
	Если ТипЗнч(Параметры) = Тип("Структура") Тогда
		ПоместитьВоВременноеХранилище(СписокДокументов, Параметры.АдресРезультата);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьТипыДокументов(ТипыДокументов) Экспорт
    
	ОписаниеТиповОбъектов = Новый ОписаниеТипов;
	ДобавляемыеТипы = Новый Массив;
	ДобавляемыеТипы.Добавить(Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию"));
	ДобавляемыеТипы.Добавить(Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств"));
	ДобавляемыеТипы.Добавить(Тип("ДокументСсылка.бит_пз_ЗаявкаНаЗатраты"));
	ДобавляемыеТипы.Добавить(Тип("ДокументСсылка.бит_кзн_ПланируемоеПоступлениеДенежныхСредств"));
	ДобавляемыеТипы.Добавить(Тип("ДокументСсылка.бит_пз_СводнаяЗаявкаНаЗатраты"));
	ДобавляемыеТипы.Добавить(Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств"));
	ОписаниеТиповОбъектов = Новый ОписаниеТипов(ОписаниеТиповОбъектов, ДобавляемыеТипы);
	
	ТипыДокументов.Очистить();
    ТипыОбъектовДляЗаполнения = ОписаниеТиповОбъектов.Типы();

	Для каждого Элемент Из ТипыОбъектовДляЗаполнения Цикл
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(Элемент);
		НоваяСтрока = ТипыДокументов.Добавить();
		НоваяСтрока.Пометка		  = Истина;
		НоваяСтрока.Значение	  = МетаданныеОбъекта.Имя;
		НоваяСтрока.Представление = МетаданныеОбъекта.Представление();
	КонецЦикла;
		
КонецПроцедуры

Функция ВыбранныеТипы(ТипыДокументов) Экспорт

	ВыбранныеТипы = Новый Массив;
	Для каждого СтрокаТаблицы Из ТипыДокументов Цикл
		Если СтрокаТаблицы.Пометка Тогда
			ВыбранныеТипы.Добавить(СтрокаТаблицы.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВыбранныеТипы;
	
КонецФункции

Функция ИнициализироватьКомпоновщик(Компоновщик, ВыбранныеТипы, ПользовательскиеНастройки) Экспорт
	
	СхемаКомпоновкиДанных = ПолучитьМакет("МакетКомпоновки");
	НаборДанныхСКД		  = СхемаКомпоновкиДанных.НаборыДанных[0];
	ЭлементыНабора		  = НаборДанныхСКД.Элементы;
	
	Индекс = ЭлементыНабора.Количество() - 1;
	Пока Индекс >= 0 Цикл
		ЭлементНабора = ЭлементыНабора.Получить(Индекс);
		Если ВыбранныеТипы.Найти(ЭлементНабора.Имя) = Неопределено Тогда
			ЭлементыНабора.Удалить(Индекс);	
		КонецЕсли;	
		Индекс = Индекс - 1;
	КонецЦикла;
	
	бит_МеханизмДопИзмерений.СформироватьЗаголовкиПолейДополнительныхИзмеренийВСКД(СхемаКомпоновкиДанных, 
		СхемаКомпоновкиДанных.НаборыДанных[0].Имя, 
		бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений"));

	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
	
	Компоновщик.Инициализировать(ИсточникНастроек);
	Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Компоновщик.ЗагрузитьПользовательскиеНастройки(ПользовательскиеНастройки);
	Компоновщик.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	
	Возврат АдресСхемыКомпоновкиДанных;
	
КонецФункции

Функция ЗаполнитьПереченьДокументов(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных) Экспорт

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных,,,
							Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ТаблицаПереченьПолный = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаПереченьПолный);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ТаблицаПереченьПолный;
	
КонецФункции

Функция НовыеСохраняемыеНастройки() Экспорт 

	СохраняемыеНастройки = Новый Структура;
	СохраняемыеНастройки.Вставить("ВариантПериода", ВариантСтандартногоПериода.Сегодня);
	СохраняемыеНастройки.Вставить("РежимСообщений", "");
	СохраняемыеНастройки.Вставить("РежимЗаписи", "");
	СохраняемыеНастройки.Вставить("ПричинаЗакрытия", Неопределено);
	СохраняемыеНастройки.Вставить("ПользовательскиеНастройки", Новый ПользовательскиеНастройкиКомпоновкиДанных);
	СохраняемыеНастройки.Вставить("ВыбранныеТипы", Новый Массив);
	
	Возврат СохраняемыеНастройки;

КонецФункции

Функция ПрименитьНастройки(НастройкаПодбораДокументов, ТипыДокументов, Обработка) Экспорт
	
	ШаблонНастроек = НовыеСохраняемыеНастройки();

	Если ЗначениеЗаполнено(НастройкаПодбораДокументов) Тогда
		
		РеквизитыНастройки 	 = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаПодбораДокументов, "ХранилищеНастроек");
		СохраненныеНастройки = РеквизитыНастройки.ХранилищеНастроек.Получить();
		
		Если ТипЗнч(СохраненныеНастройки) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ШаблонНастроек, СохраненныеНастройки);
		КонецЕсли;  		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Обработка, ШаблонНастроек);
	
	ВыбранныеТипы = ШаблонНастроек.ВыбранныеТипы;
	Если ЗначениеЗаполнено(ВыбранныеТипы) Тогда
		ТипыДокументов.ЗаполнитьПометки(Ложь);
		Для каждого Элемент Из ВыбранныеТипы Цикл
			РезультатПоиска = ТипыДокументов.НайтиПоЗначению(Элемент);
			Если РезультатПоиска <> Неопределено Тогда
				РезультатПоиска.Пометка = Истина;				
			КонецЕсли;		
		КонецЦикла;
	Иначе
		ВыбранныеТипы = ТипыДокументов.ВыгрузитьЗначения();	
	КонецЕсли;
	
	ВыбранныеТипы = ВыбранныеТипы(ТипыДокументов);
	
	АдресСКД = ИнициализироватьКомпоновщик(Обработка.КомпоновщикНастроек, 
						ВыбранныеТипы, ШаблонНастроек.ПользовательскиеНастройки);
						
	Если НЕ ЗначениеЗаполнено(Обработка.РежимЗаписи) Тогда
		Обработка.РежимЗаписи = "Запись";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Обработка.РежимСообщений) Тогда
		Обработка.РежимСообщений = "Все";
	КонецЕсли;
	
	НастройкаПериода = Новый СтандартныйПериод(ШаблонНастроек.ВариантПериода);
	Обработка.Период = НастройкаПериода;
	
	Если НЕ ЗначениеЗаполнено(Обработка.ПричинаЗакрытия) И Обработка.ЭтоРегламентнаяОперация Тогда
		Обработка.ПричинаЗакрытия = Справочники.бит_ПричиныЗакрытияДокументовПланированияПлатежа.Регламент;
	КонецЕсли;

	Возврат АдресСКД;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПереченьДокументов()

	ТекстЗапроса = 
    "ВЫБРАТЬ
    |	ПереченьДокументов.Организация КАК Организация,
    |	ПереченьДокументов.ДокументПланирования КАК ДокументПланирования,
    |	ПереченьДокументов.Позиция КАК Позиция,
    |	ВЫБОР
    |		КОГДА ПереченьДокументов.ПричинаЗакрытия = ЗНАЧЕНИЕ(Справочник.бит_ПричиныЗакрытияДокументовПланированияПлатежа.ПустаяСсылка)
    |			ТОГДА &ПричинаЗакрытия
    |		ИНАЧЕ ПереченьДокументов.ПричинаЗакрытия
    |	КОНЕЦ КАК ПричинаЗакрытия,
    |	ПереченьДокументов.Закрыть КАК Закрыть
    |ПОМЕСТИТЬ ВТ_ОбщийСписок
    |ИЗ
    |	&ПереченьДокументов КАК ПереченьДокументов
    |ГДЕ
    |	ПереченьДокументов.Закрыть
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	ВТ_ОбщийСписок.Организация КАК Организация,
    |	ВТ_ОбщийСписок.ДокументПланирования КАК ДокументПланирования,
    |	МАКСИМУМ(ВТ_ОбщийСписок.ПричинаЗакрытия) КАК ПричинаЗакрытия,
    |	ВТ_ОбщийСписок.Закрыть КАК Закрыть
    |ИЗ
    |	ВТ_ОбщийСписок КАК ВТ_ОбщийСписок
    |
    |СГРУППИРОВАТЬ ПО
    |	ВТ_ОбщийСписок.Организация,
    |	ВТ_ОбщийСписок.ДокументПланирования,
    |	ВТ_ОбщийСписок.Закрыть
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ВТ_ОбщийСписок.Организация,
    |	ВТ_ОбщийСписок.Позиция,
    |	ВТ_ОбщийСписок.ПричинаЗакрытия,
    |	ВТ_ОбщийСписок.Закрыть
    |ИЗ
    |	ВТ_ОбщийСписок КАК ВТ_ОбщийСписок
    |ГДЕ
    |	ВТ_ОбщийСписок.Позиция <> НЕОПРЕДЕЛЕНО
    |ИТОГИ ПО
    |	Организация";

	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();

КонецФункции

#КонецОбласти

#КонецЕсли
